## 📋 Plan: shared
```
time=2026-02-07T20:36:48Z level=info msg=The stack at /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/vpc

Group 2
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/alb
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/rds

Group 3
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/dns-ssl


time=2026-02-07T20:36:48Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/vpc into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/vpc/.terragrunt-cache/mbdfMv_ksrde8Ln711R8MgigXHQ/iM3ABwuRCsIAAtWw8PB50S2x-wc prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/vpc] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.aws_availability_zones.available: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0b2b495c6407fd63c]
aws_eip.nat: Refreshing state... [id=eipalloc-05c713be30bc9fded]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_subnet.public[1]: Refreshing state... [id=subnet-04c617e8ec108a934]
aws_subnet.public[0]: Refreshing state... [id=subnet-0473592c4cbdc92f8]
aws_route_table.private: Refreshing state... [id=rtb-03bf8fcb4df963bf5]
aws_subnet.private[1]: Refreshing state... [id=subnet-073b0f380ac11f36c]
aws_internet_gateway.main: Refreshing state... [id=igw-02286fe2a20987bc5]
aws_subnet.private[0]: Refreshing state... [id=subnet-00636eb2426e13332]
aws_route_table.public: Refreshing state... [id=rtb-0fe69a513ee147f00]
aws_route.public_internet: Refreshing state... [id=r-rtb-0fe69a513ee147f001080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04d97d35ee9eb0dcd]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03b664e386b454f6c]
aws_nat_gateway.main: Refreshing state... [id=nat-02de62c675fe1d7fe]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04ef624755130e8c4]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b71bf1ab4990f4db]
aws_route.private_nat: Refreshing state... [id=r-rtb-03bf8fcb4df963bf51080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-02-07T20:37:03Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/rds into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/rds/.terragrunt-cache/SCi9XWNU4BwUnEfhFLAbad-NtgQ/gZKxcX0rfiK_EG_D7mjcuLZrqxU prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/rds] 
time=2026-02-07T20:37:03Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/alb into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/alb/.terragrunt-cache/StC2s3lEhF0SqjmsZSLn9_EE6zo/wcqUGR-qdynyB9Mp3ODPrt2DXLg prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/alb] 

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hashicorp/aws v6.31.0...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)
- Installing hashicorp/random v3.8.1...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/random v3.8.1 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
random_password.master: Refreshing state... [id=none]
random_password.production: Refreshing state... [id=none]
random_password.staging: Refreshing state... [id=none]
aws_lb_target_group.production: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:targetgroup/dgx-production-tg/26e6e052a1629ed3]
aws_lb_target_group.adminer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:targetgroup/dgx-adminer-tg/81c8ea9ab211c467]
aws_security_group.alb: Refreshing state... [id=sg-0fc58af0c9701179b]
aws_lb_target_group.staging: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:targetgroup/dgx-staging-tg/52412addbbe92f5b]
aws_ssm_parameter.db_password_staging: Refreshing state... [id=/dgx/staging/db/password]
aws_ssm_parameter.db_username_staging: Refreshing state... [id=/dgx/staging/db/username]
aws_ssm_parameter.db_name_staging: Refreshing state... [id=/dgx/staging/db/name]
aws_ssm_parameter.db_password_production: Refreshing state... [id=/dgx/production/db/password]
aws_ssm_parameter.db_master_password: Refreshing state... [id=/dgx/shared/db/master_password]
aws_db_subnet_group.main: Refreshing state... [id=dgx-shared-db-subnet]
aws_ssm_parameter.db_name_production: Refreshing state... [id=/dgx/production/db/name]
aws_ssm_parameter.db_username_production: Refreshing state... [id=/dgx/production/db/username]
aws_security_group.rds: Refreshing state... [id=sg-061ca12584235eb4f]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:loadbalancer/app/dgx-shared-alb/415fd090a9a3962f]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:listener/app/dgx-shared-alb/415fd090a9a3962f/d72854b5f841c21f]
aws_lb_listener.https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:listener/app/dgx-shared-alb/415fd090a9a3962f/c7be6043619365e2]
aws_db_instance.main: Refreshing state... [id=db-4LKWCW6GRXYEEMVYHJTQNSJD5I]
aws_ssm_parameter.db_port: Refreshing state... [id=/dgx/shared/db/port]
aws_ssm_parameter.db_host: Refreshing state... [id=/dgx/shared/db/host]
aws_lb_listener_rule.https_production[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:listener-rule/app/dgx-shared-alb/415fd090a9a3962f/c7be6043619365e2/44915c058ff8b09d]
aws_lb_listener_rule.https_adminer[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:listener-rule/app/dgx-shared-alb/415fd090a9a3962f/c7be6043619365e2/22fdfa7b341050f3]
aws_lb_listener_rule.https_staging[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:746393610736:listener-rule/app/dgx-shared-alb/415fd090a9a3962f/c7be6043619365e2/104f3b56c5b5c827]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-02-07T20:37:19Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/dns-ssl into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/dns-ssl/.terragrunt-cache/gO_Wo2Q6DfOXHZ8Bbb0-AmHtiyU/X7NUl64LWDFq557my9WtxYuzWjU prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/shared/dns-ssl] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_acm_certificate.cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:746393610736:certificate/d6f35c81-25ae-4979-a52f-d625ab04caf0]
aws_route53_zone.main: Refreshing state... [id=Z02066231M3B95UP3UPI1]
aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:us-east-2:746393610736:certificate/745b01a3-6d3f-4a14-9366-56df1b64b2e4]
aws_route53_record.adminer: Refreshing state... [id=Z02066231M3B95UP3UPI1_db-cms.wizioners.com_A]
aws_route53_record.frontend_production[0]: Refreshing state... [id=Z02066231M3B95UP3UPI1_cms.wizioners.com_A]
aws_route53_record.alb_cert_validation["wizioners.com"]: Refreshing state... [id=Z02066231M3B95UP3UPI1__1a278b7cf8ac64e9b740ad465c738be8.wizioners.com._CNAME]
aws_route53_record.alb_cert_validation["*.wizioners.com"]: Refreshing state... [id=Z02066231M3B95UP3UPI1__1a278b7cf8ac64e9b740ad465c738be8.wizioners.com._CNAME]
aws_acm_certificate_validation.alb: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_acm_certificate_validation.cloudfront: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.api_production will be created
  + resource "aws_route53_record" "api_production" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-cms.wizioners.com"
      + type            = "A"
      + zone_id         = "Z02066231M3B95UP3UPI1"

      + alias {
          + evaluate_target_health = true
          + name                   = "dgx-shared-alb-1183087961.us-east-2.elb.amazonaws.com"
          + zone_id                = "Z3AADJGX6KTTL2"
        }
    }

  # aws_route53_record.api_staging will be created
  + resource "aws_route53_record" "api_staging" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-staging-cms.wizioners.com"
      + type            = "A"
      + zone_id         = "Z02066231M3B95UP3UPI1"

      + alias {
          + evaluate_target_health = true
          + name                   = "dgx-shared-alb-1183087961.us-east-2.elb.amazonaws.com"
          + zone_id                = "Z3AADJGX6KTTL2"
        }
    }

  # aws_route53_record.frontend_staging[0] will be created
  + resource "aws_route53_record" "frontend_staging" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging-cms.wizioners.com"
      + type            = "A"
      + zone_id         = "Z02066231M3B95UP3UPI1"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1x273q7voau0c.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```